performance-test-reports/automated-security-tests/12609605490/1/user-registration/user_registration/run.log
-    █ [Create Account Service]

-      █ should be able to register new user successfully

-        ✓ is status 200
-        ✓ response body
-        ✓ expected status to equal 200
-        ✓ expected user registration api response to equal 'User Registered'

-    checks.........................: 100.00% ✓ 2404      ✗ 0    
-    data_received..................: 115 kB  1.9 kB/s
-    data_sent......................: 166 kB  2.8 kB/s
-    group_duration.................: avg=12.98ms  min=3.17ms  med=4.1ms    max=844.98ms p(90)=5.41ms   p(95)=6.93ms  
-    http_req_blocked...............: avg=176.64µs min=126.4µs med=170.91µs max=437.85µs p(90)=215.53µs p(95)=231.47µs
-    http_req_connecting............: avg=127.37µs min=94.04µs med=122.05µs max=378.34µs p(90)=158.31µs p(95)=169.45µs
-  ✓ http_req_duration..............: avg=11.95ms  min=2.23ms  med=3.06ms   max=843.71ms p(90)=4.35ms   p(95)=5.92ms  
-      { expected_response:true }...: avg=11.95ms  min=2.23ms  med=3.06ms   max=843.71ms p(90)=4.35ms   p(95)=5.92ms  
-  ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 601  
-    http_req_receiving.............: avg=60.83µs  min=38.59µs med=59.7µs   max=129µs    p(90)=74.04µs  p(95)=79.83µs 
-    http_req_sending...............: avg=39.27µs  min=18.06µs med=37.99µs  max=263.76µs p(90)=52.81µs  p(95)=57.38µs 
-    http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=11.85ms  min=2.16ms  med=2.96ms   max=843.63ms p(90)=4.26ms   p(95)=5.81ms  
-    http_reqs......................: 601     10.014144/s
-    iteration_duration.............: avg=13.03ms  min=3.21ms  med=4.15ms   max=845.05ms p(90)=5.46ms   p(95)=6.96ms  
-    iterations.....................: 601     10.014144/s
-    vus............................: 0       min=0       max=3  
-    vus_max........................: 200     min=200     max=200